# PANDAS - in depth (part1)


Data Manipulation comprises of following three stages:

   * Data preparation : we looked at various functions such as merge(), concat, combine, pivot etc for data preparation.
   * Data transformation
   * Data aggregation
   
In this lecture we will be looking at how we can perform the above operations using Pandas library.

In [254]:
# Setting up working environment

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.set_option('max_columns', 50)
%matplotlib inline

In [255]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'], 'price': [12.33,11.44,33.21,13.23,33.62]})

In [256]:
frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'], 'color': ['white','red','red','black']})

In [257]:
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [258]:
frame2

   color      id
0  white  pencil
1    red  pencil
2    red    ball
3  black     pen

In [259]:
# Merge the two dataframes

merged_frame = pd.merge(frame1,frame2)

In [260]:
merged_frame

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

In [261]:
# Example 2: When more than one column name matches in dataframes

frame1 = pd.DataFrame({'id':['ball','pencil','pen','mug','ashtray'],'color': ['white','red','red','black','green'],
'brand': ['OMG','ABC','ABC','POD','POD']})

In [262]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [263]:
frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'],'brand': ['OMG','POD','ABC','POD']})

In [264]:
frame2

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [265]:
result=pd.merge(frame1,frame2)

In [266]:
result

Empty DataFrame
Columns: [brand, color, id]
Index: []

In [267]:
# Since both columns of frame2 are present in frame1. Ambiguity !
# Results in empty dataframe

In [268]:
result.columns

Index(['brand', 'color', 'id'], dtype='object')

### Use ‘on’ option to explicitly define the criterion of merging that pandas must follow

In [269]:
# Merge on the basis of 'id' column

pd.merge(frame1,frame2,on='id')

  brand_x  color      id brand_y
0     OMG  white    ball     ABC
1     ABC    red  pencil     OMG
2     ABC    red  pencil     POD
3     ABC    red     pen     POD

In [270]:
# Merge on the basis of 'brand' column

pd.merge(frame1,frame2,on='brand')

  brand  color     id_x    id_y
0   OMG  white     ball  pencil
1   ABC    red   pencil    ball
2   ABC    red      pen    ball
3   POD  black      mug  pencil
4   POD  black      mug     pen
5   POD  green  ashtray  pencil
6   POD  green  ashtray     pen

### What if key columns in two DataFrames do not have the same name?

use the left_on and right_on options that specify the key column for the first and for the second DataFrame.

In [271]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [272]:
# Lets use 'sid' to refer id in frame2

frame2 = pd.DataFrame({'sid':['pencil','pencil','ball','pen'],'brand': ['OMG','POD','ABC','POD']})

In [273]:
frame2

  brand     sid
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [274]:
pd.merge(frame1, frame2, left_on='id', right_on='sid')

  brand_x  color      id brand_y     sid
0     OMG  white    ball     ABC    ball
1     ABC    red  pencil     OMG  pencil
2     ABC    red  pencil     POD  pencil
3     ABC    red     pen     POD     pen

By default, the merge( ) function performs an inner join; the keys in the result are the result of an intersection.


## Using 'how' option to specify type of join operation

In [275]:
# Lets make both dataframe have the same 'id' key/column

frame2 = pd.DataFrame({'id':['pencil','pencil','ball','pen'],'brand': ['OMG','POD','ABC','POD']})

In [276]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [277]:
frame2

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [278]:
# Perfrom outer join on frame1 and frame2

pd.merge(frame1,frame2,on='id',how='outer')


# ensures all rows included from both frame even if they don’t match

  brand_x  color       id brand_y
0     OMG  white     ball     ABC
1     ABC    red   pencil     OMG
2     ABC    red   pencil     POD
3     ABC    red      pen     POD
4     POD  black      mug     NaN
5     POD  green  ashtray     NaN

In [279]:
# Driving the merge from the left:

pd.merge(frame1,frame2,on='id',how='left')   


# all rows from frame1 and any rows from frame2 that match

  brand_x  color       id brand_y
0     OMG  white     ball     ABC
1     ABC    red   pencil     OMG
2     ABC    red   pencil     POD
3     ABC    red      pen     POD
4     POD  black      mug     NaN
5     POD  green  ashtray     NaN

In [280]:
# From the right

pd.merge(frame1,frame2,on='id',how='right') 
         
# all rows from frame2 and any rows from frame1 that match

  brand_x  color      id brand_y
0     OMG  white    ball     ABC
1     ABC    red  pencil     OMG
2     ABC    red  pencil     POD
3     ABC    red     pen     POD

### To merge multiple keys, simply add a list to the on option

In [281]:
frame1   # lets just print the contents of frame1 again

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [282]:
frame2   # lets just print the contents of frame2 again

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [283]:
pd.merge(frame1,frame2,on=['id','brand'],how='outer')  # Result of merge on two keys

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray
5   OMG    NaN   pencil
6   POD    NaN   pencil
7   ABC    NaN     ball
8   POD    NaN      pen

In [284]:
# TODO

# Look into the tutorials provided and copy paste code segment and play around

# Careful with the copy paste... especially with the single quote '' characters

# Concatenating

In [285]:
# NumPy has a concatenate function for concatenating arrays:

array1 = np.array([[0, 1, 2], [3, 4, 5], [6, 7, 8]])
array2 = np.arange(9).reshape((3,3))+6

In [286]:
array3 = np.concatenate([array1,array2],axis=1)   # horizontally - from left to right

In [287]:
array3

array([[ 0,  1,  2,  6,  7,  8],
       [ 3,  4,  5,  9, 10, 11],
       [ 6,  7,  8, 12, 13, 14]])

In [288]:
np.concatenate([array1,array2],axis=0)  # vertically - from top to bottom

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [289]:
# The Pandas concat() function

In [290]:
ser1 = pd.Series(np.random.rand(4), index=[1,2,3,4])
ser2 = pd.Series(np.random.rand(4), index=[5,6,7,8])

In [291]:
ser1

1    0.755030
2    0.870049
3    0.413392
4    0.132862
dtype: float64

In [292]:
ser2

5    0.990796
6    0.828894
7    0.747810
8    0.988035
dtype: float64

In [293]:
# concatenate the two series

ser3 = pd.concat([ser1,ser2])   # default behaviour

In [294]:
ser3

1    0.755030
2    0.870049
3    0.413392
4    0.132862
5    0.990796
6    0.828894
7    0.747810
8    0.988035
dtype: float64

   * By default, the concat() function works on axis = 0, returning a series object.
   * If you set the axis = 1, then the result will be a DataFrame.

In [295]:
ser3 = pd.concat([ser1,ser2],axis=1)   # horizontally - from left to right

In [296]:
ser3

          0         1
1  0.755030       NaN
2  0.870049       NaN
3  0.413392       NaN
4  0.132862       NaN
5       NaN  0.990796
6       NaN  0.828894
7       NaN  0.747810
8       NaN  0.988035

This has performed an outer join. It can be changed by setting the join option to 'inner’:

In [297]:
pd.concat([ser1,ser2],axis=1,join='inner')

Empty DataFrame
Columns: [0, 1]
Index: []

In [298]:
# what will be the output? 

# pd.concat([ser1,ser3],axis=1,join='inner')   # uncomment and run this cell
                                               # analyse what is happening here !!

In [299]:
# To create a hierarchical index on the axis of concatenation we need to use the keys option:

pd.concat([ser1,ser2], keys=[1,2])  # creating a hierarchical data structure !

1  1    0.755030
   2    0.870049
   3    0.413392
   4    0.132862
2  5    0.990796
   6    0.828894
   7    0.747810
   8    0.988035
dtype: float64

# Concatenating dataframes

In [300]:
frame1 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[1,2,3], columns=['A','B','C'])
frame2 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[4,5,6], columns=['A','B','C'])

In [301]:
frame1

          A         B         C
1  0.636375  0.758608  0.418541
2  0.798083  0.722094  0.797947
3  0.912093  0.437887  0.167617

In [302]:
frame2

          A         B         C
4  0.529171  0.835750  0.468032
5  0.600096  0.746683  0.229856
6  0.324630  0.863182  0.649830

In [303]:
pd.concat([frame1, frame2])   # defaults to rows

          A         B         C
1  0.636375  0.758608  0.418541
2  0.798083  0.722094  0.797947
3  0.912093  0.437887  0.167617
4  0.529171  0.835750  0.468032
5  0.600096  0.746683  0.229856
6  0.324630  0.863182  0.649830

In [304]:
# Along the column-axis or horizontally from left to right

pd.concat([frame1, frame2], axis=1)

          A         B         C         A         B         C
1  0.636375  0.758608  0.418541       NaN       NaN       NaN
2  0.798083  0.722094  0.797947       NaN       NaN       NaN
3  0.912093  0.437887  0.167617       NaN       NaN       NaN
4       NaN       NaN       NaN  0.529171  0.835750  0.468032
5       NaN       NaN       NaN  0.600096  0.746683  0.229856
6       NaN       NaN       NaN  0.324630  0.863182  0.649830

# Combine()

If we wish the two datasets to have indexes that overlap in their entirety or at least partially, we can use
combine_first().

In [305]:
ser1 = pd.Series(np.random.rand(5),index=[1,2,3,4,5])
ser2 = pd.Series(np.random.rand(4),index=[2,4,5,6])

In [306]:
ser1

1    0.683964
2    0.279121
3    0.841886
4    0.769307
5    0.701232
dtype: float64

In [307]:
ser2

2    0.399457
4    0.075839
5    0.795955
6    0.186127
dtype: float64

In [308]:
ser1.combine_first(ser2)

1    0.683964
2    0.279121
3    0.841886
4    0.769307
5    0.701232
6    0.186127
dtype: float64

In [309]:
# If you want a partial overlap, you can specify only the portion of the Series you want to overlap.

ser1[:3].combine_first(ser2[:3])

1    0.683964
2    0.279121
3    0.841886
4    0.075839
5    0.795955
dtype: float64

# Pivoting with Hierarchical Indexing

In the context of pivoting there are two basic operations:
  * Stacking: rotates or pivots the data structure converting columns to rows
  * Unstacking: converts rows into columns

In [310]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3), index=['white','black','red'],columns=['ball','pen','pencil'])

In [311]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [312]:
# Using the stack() function on the DataFrame, pivots the columns into rows, thus producing a series:

ser5 = frame1.stack()

In [313]:
ser5

white  ball      0
       pen       1
       pencil    2
black  ball      3
       pen       4
       pencil    5
red    ball      6
       pen       7
       pencil    8
dtype: int64

In [314]:
# From this hierarchically indexed series, you can reassemble the DataFrame into a pivoted table 
# by use of the unstack() function.

ser5.unstack()

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [315]:
# You can also do the unstack on a different level, specifying the number of levels or its name as the
# argument of the function.

ser5.unstack(0)

        white  black  red
ball        0      3    6
pen         1      4    7
pencil      2      5    8

## Removing columns and rows

In [316]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3), index=['white','black','red'],columns=['ball','pen','pencil'])

In [317]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [318]:
# To remove a column, simply use the del command applied to the DataFrame with the column name specified

del frame1['ball']

In [319]:
frame1

       pen  pencil
white    1       2
black    4       5
red      7       8

In [320]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3), index=['white','black','red'],columns=['ball','pen','pencil'])

In [321]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [322]:
# To remove an unwanted row, you have to use the drop() function with the label of the corresponding
# index as argument

frame1.drop('white')

       ball  pen  pencil
black     3    4       5
red       6    7       8